# Group by

In [1]:
import pandas as pd

In [5]:
var = pd.DataFrame({"name":["a","b","c","d","a","b","a","b","a","c","d"],"s_1":[12,13,14,12,13,14,15,23,25,16,10],
                   "s_2":[23,24,25,26,27,28,29,30,25,35,34]})

var

   name  s_1  s_2
0     a   12   23
1     b   13   24
2     c   14   25
3     d   12   26
4     a   13   27
5     b   14   28
6     a   15   29
7     b   23   30
8     a   25   25
9     c   16   35
10    d   10   34

In [7]:
var_New=var.groupby("name")
var_New

In [10]:
for x,y in var_New:
    print(x)
    print(y)
    print()

a
  name  s_1  s_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

b
  name  s_1  s_2
1    b   13   24
5    b   14   28
7    b   23   30

c
  name  s_1  s_2
2    c   14   25
9    c   16   35

d
   name  s_1  s_2
3     d   12   26
10    d   10   34

In [11]:
var_New.get_group("a")

  name  s_1  s_2
0    a   12   23
4    a   13   27
6    a   15   29
8    a   25   25

In [12]:
var_New.min()

      s_1  s_2
name
a      12   23
b      13   24
c      14   25
d      10   26

In [14]:
var_New.mean()

            s_1        s_2
name
a     16.250000  26.000000
b     16.666667  27.333333
c     15.000000  30.000000
d     11.000000  30.000000

In [17]:
li =list(var_New)
li

[('a',
    name  s_1  s_2
  0    a   12   23
  4    a   13   27
  6    a   15   29
  8    a   25   25),
 ('b',
    name  s_1  s_2
  1    b   13   24
  5    b   14   28
  7    b   23   30),
 ('c',
    name  s_1  s_2
  2    c   14   25
  9    c   16   35),
 ('d',
     name  s_1  s_2
  3     d   12   26
  10    d   10   34)]